name: "AlexNet"
state {
  phase: TEST
}
debug_info: true
roi_accuracy: NONE
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 227
    mean_file: "/home/scratch.yilinz_t19x_2/t19x/caffe-master-amodel/data/ilsvrc12/imagenet_mean.binaryproto"
    shifter: 0
    bits: 16
    type: FP16
  }
  data_param {
    source: "/home/scratch.yilinz_t19x_2/t19x/caffe-master-amodel/../val_db0"
    batch_size: 50
    backend: LMDB
    skip: 0
  }
}
layer {
  name: "image_dumper"
  type: "Dump"
  bottom: "data"
  top: "data"
  dump_param {
    filename: "input_image.dat"
    method:   DumpMethod_PROTO_TXT
  }
}
layer {
  name: "data_convert0"
  type: "Convertor"
  bottom: "data"
  top: "data"
  convert_param {
    from: DBL
    to: FP16
    to_coef {
      scale: 1
      shifter: 0
      comp_scale: 1
      comp_shifter: 0
      bits: 16
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: FP32
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: FP16
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    bias_convert {
      from: DBL
      to: FP16
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    fp16_exp_dump {
        filename: "conv1_max_exp.dat"
        method:   DumpMethod_PROTO_TXT
    }
    input_mean: 0
    dump_data_type: 0xe
    debug_dump {
        filename: "conv1_dump.dat"
        method:   DumpMethod_PROTO_TXT
        format:   Format_FP16
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "relu1"
}
layer {
  name: "relu1_convert0"
  type: "Convertor"
  bottom: "relu1"
  top: "relu1"
  convert_param {
    from: DBL
    to: FP16
    to_coef {
      scale: 1
      shifter: 0
      comp_scale: 1
      comp_shifter: 0
      bits: 16
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "relu1_dump"
  type: "Dump"
  bottom: "relu1"
  top: "relu1"
  dump_param {
    filename: "relu1_dump_out.dat"
    method:   DumpMethod_PROTO_TXT
  }
}
layer {
  name: "norm1"
  type: "NVLRN"
  bottom: "relu1"
  top: "norm1"
  nv_lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
    norm_region: ACROSS_CHANNELS
    k: 1
    lut_param {
      density_start: 7323.0841322457145
      density_win_size: 17
      raw_tbl_entry: 65
      density_tbl_entry: 257
      sym: NO_SYM
      lut_convert {
        from: DBL
        to: FP16
        to_coef {
          scale: 1
          shifter: 0
          comp_scale: 1
          comp_shifter: 0
          bits: 16
          offset: 0
        }
        allow_saturate: false
        method: STD_RN
        dr_ratio: 0
      }
      raw_step_method: EXP_STEP
      raw_min: -1.8596236132251811e-09
      raw_max: 4294967296
      priority: LO_TBL
      shifter: 0
      interp_bits: 16
      disable_density: false
      exp_raw_shifter: -32
      overflow_priority: LE_TBL
      underflow_priority: LE_TBL
      density_overflow_slope: -1.0415825499876519e-06
      density_underflow_slope: -1.3304660569701809e-05
      raw_overflow_slope: 0
      raw_underflow_slope: 0
      pipe: FP
      lut_filename: "norm1_lut.dat"
    }
  }
}
layer {
  name: "norm1_convert0"
  type: "Convertor"
  bottom: "norm1"
  top: "norm1"
  convert_param {
    from: DBL
    to: FP16
    to_coef {
      scale: 1
      shifter: 0
      comp_scale: 1
      comp_shifter: 0
      bits: 16
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "cdp1_dump"
  type: "Dump"
  bottom: "norm1"
  top: "norm1"
  dump_param {
    filename: "norm1_dump_out.dat"
    method:   DumpMethod_PROTO_TXT
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "norm1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "pdp1_dump"
  type: "Dump"
  bottom: "pool1"
  top: "pool1"
  dump_param {
    filename: "pool1_dump_out.dat"
    method:   DumpMethod_PROTO_TXT
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: FP32
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: FP16
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    bias_convert {
      from: DBL
      to: FP16
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    fp16_exp_dump {
        filename: "conv2_max_exp.dat"
        method:   DumpMethod_PROTO_TXT
    }
    input_mean: 0
    dump_data_type: 0xe
    debug_dump {
        filename: "conv2_dump.dat"
        method:   DumpMethod_PROTO_TXT
        format:   Format_FP16
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "relu2_convert0"
  type: "Convertor"
  bottom: "conv2"
  top: "conv2"
  convert_param {
    from: DBL
    to: FP16
    to_coef {
      scale: 1
      shifter: 0
      comp_scale: 1
      comp_shifter: 0
      bits: 16
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "relu2_dump"
  type: "Dump"
  bottom: "conv2"
  top: "conv2"
  dump_param {
    filename: "relu2_dump_out.dat"
    method:   DumpMethod_PROTO_TXT
  }
}
layer {
  name: "norm2"
  type: "NVLRN"
  bottom: "conv2"
  top: "norm2"
  nv_lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
    norm_region: ACROSS_CHANNELS
    k: 1
    lut_param {
      density_start: 427.86424847401457
      density_win_size: 15
      raw_tbl_entry: 65
      density_tbl_entry: 257
      sym: NO_SYM
      lut_convert {
        from: DBL
        to: FP16
        to_coef {
          scale: 1
          shifter: 0
          comp_scale: 1
          comp_shifter: 0
          bits: 16
          offset: 0
        }
        allow_saturate: false
        method: STD_RN
        dr_ratio: 0
      }
      raw_step_method: EXP_STEP
      raw_min: -2.7755576316793745e-10
      raw_max: 4294967296
      priority: LO_TBL
      shifter: 0
      interp_bits: 16
      disable_density: false
      exp_raw_shifter: -32
      overflow_priority: LE_TBL
      underflow_priority: LE_TBL
      density_overflow_slope: -5.9983640312566422e-06
      density_underflow_slope: -1.4888559235259891e-05
      raw_overflow_slope: 0
      raw_underflow_slope: 0
      pipe: FP
      lut_filename: "norm2_lut.dat"
    }
  }
}
layer {
  name: "norm2_convert0"
  type: "Convertor"
  bottom: "norm2"
  top: "norm2"
  convert_param {
    from: DBL
    to: FP16
    to_coef {
      scale: 1
      shifter: 0
      comp_scale: 1
      comp_shifter: 0
      bits: 16
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "norm2_dump"
  type: "Dump"
  bottom: "norm2"
  top: "norm2"
  dump_param {
    filename: "norm2_dump_out.dat"
    method:   DumpMethod_PROTO_TXT
  }
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "norm2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "pool2_dump"
  type: "Dump"
  bottom: "pool2"
  top: "pool2"
  dump_param {
    filename: "pool2_dump_out.dat"
    method:   DumpMethod_PROTO_TXT
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    engine: WINOGRAD
    output_truncat {
      from: DBL
      to: FP32
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    bias_convert {
      from: DBL
      to: FP16
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    pra_feature_truncat {
      from: DBL
      to: FP16
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    pra_weight_convert {
      from: DBL
      to: FP16
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    fp16_exp_dump {
        filename: "conv3_max_exp.dat"
        method:   DumpMethod_PROTO_TXT
    }
    input_mean: 0
    dump_data_type: 0x1c
    debug_dump {
        filename: "conv3_dump.dat"
        method:   DumpMethod_PROTO_TXT
        format:   Format_FP16
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "relu3_convert0"
  type: "Convertor"
  bottom: "conv3"
  top: "conv3"
  convert_param {
    from: DBL
    to: FP16
    to_coef {
      scale: 1
      shifter: 0
      comp_scale: 1
      comp_shifter: 0
      bits: 16
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "conv3_dump"
  type: "Dump"
  bottom: "conv3"
  top: "conv3"
  dump_param {
    filename: "relu3_dump_out.dat"
    method:   DumpMethod_PROTO_TXT
  }
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
    engine: WINOGRAD
    output_truncat {
      from: DBL
      to: FP32
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    bias_convert {
      from: DBL
      to: FP16
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    pra_feature_truncat {
      from: DBL
      to: FP16
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    pra_weight_convert {
      from: DBL
      to: FP16
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    fp16_exp_dump {
        filename: "conv4_max_exp.dat"
        method:   DumpMethod_PROTO_TXT
    }
    input_mean: 0
    dump_data_type: 0x1c
    debug_dump {
        filename: "conv4_dump.dat"
        method:   DumpMethod_PROTO_TXT
        format:   Format_FP16
    }
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "relu4_convert0"
  type: "Convertor"
  bottom: "conv4"
  top: "conv4"
  convert_param {
    from: DBL
    to: FP16
    to_coef {
      scale: 1
      shifter: 0
      comp_scale: 1
      comp_shifter: 0
      bits: 16
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "conv4_dump"
  type: "Dump"
  bottom: "conv4"
  top: "conv4"
  dump_param {
    filename: "relu4_dump_out.dat"
    method:   DumpMethod_PROTO_TXT
  }
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
    engine: WINOGRAD
    output_truncat {
      from: DBL
      to: FP32
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    bias_convert {
      from: DBL
      to: FP16
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    pra_feature_truncat {
      from: DBL
      to: FP16
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    pra_weight_convert {
      from: DBL
      to: FP16
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    fp16_exp_dump {
        filename: "conv5_max_exp.dat"
        method:   DumpMethod_PROTO_TXT
    }
    input_mean: 0
    dump_data_type: 0x1c
    debug_dump {
        filename: "conv5_dump.dat"
        method:   DumpMethod_PROTO_TXT
        format:   Format_FP16
    }
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
layer {
  name: "relu5_convert0"
  type: "Convertor"
  bottom: "conv5"
  top: "conv5"
  convert_param {
    from: DBL
    to: FP16
    to_coef {
      scale: 1
      shifter: 0
      comp_scale: 1
      comp_shifter: 0
      bits: 16
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "conv5_dump"
  type: "Dump"
  bottom: "conv5"
  top: "conv5"
  dump_param {
    filename: "relu5_dump_out.dat"
    method:   DumpMethod_PROTO_TXT
  }
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "conv5"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "pdp5_dump"
  type: "Dump"
  bottom: "pool5"
  top: "pool5"
  dump_param {
    filename: "pdp5_dump_out.dat"
    method:   DumpMethod_PROTO_TXT
  }
}
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
    weight_convert {
      from: DBL
      to: FP16
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    bias_convert {
      from: DBL
      to: FP16
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    output_truncat {
      from: DBL
      to: FP32
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    dump_data_type: 0xe
    debug_dump {
        filename: "fc6_dump.dat"
        method:   DumpMethod_PROTO_TXT
        format:   Format_FP16
    }
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "relu6_convert0"
  type: "Convertor"
  bottom: "fc6"
  top: "fc6"
  convert_param {
    from: DBL
    to: FP16
    to_coef {
      scale: 1
      shifter: 0
      comp_scale: 1
      comp_shifter: 0
      bits: 16
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "fc6_dump"
  type: "Dump"
  bottom: "fc6"
  top: "fc6"
  dump_param {
    filename: "fc6_dump_out.dat"
    method:   DumpMethod_PROTO_TXT
  }
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
    weight_convert {
      from: DBL
      to: FP16
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    bias_convert {
      from: DBL
      to: FP16
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    output_truncat {
      from: DBL
      to: FP32
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    dump_data_type: 0xe
    debug_dump {
        filename: "fc7_dump.dat"
        method:   DumpMethod_PROTO_TXT
        format:   Format_FP16
    }
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "relu7_convert0"
  type: "Convertor"
  bottom: "fc7"
  top: "fc7"
  convert_param {
    from: DBL
    to: FP16
    to_coef {
      scale: 1
      shifter: 0
      comp_scale: 1
      comp_shifter: 0
      bits: 16
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "fc7_dump"
  type: "Dump"
  bottom: "fc7"
  top: "fc7"
  dump_param {
    filename: "fc7_dump_out.dat"
    method:   DumpMethod_PROTO_TXT
  }
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc8"
  type: "InnerProduct"
  bottom: "fc7"
  top: "fc8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1000
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    weight_convert {
      from: DBL
      to: FP16
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    bias_convert {
      from: DBL
      to: FP16
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    output_truncat {
      from: DBL
      to: FP32
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    dump_data_type: 0xe
    debug_dump {
        filename: "fc8_dump.dat"
        method:   DumpMethod_PROTO_TXT
        format:   Format_FP16
    }
  }
}
layer {
  name: "fc8_convert0"
  type: "Convertor"
  bottom: "fc8"
  top: "fc8"
  convert_param {
    from: DBL
    to: FP16
    to_coef {
      scale: 1
      shifter: 0
      comp_scale: 1
      comp_shifter: 0
      bits: 16
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "fc8_dump"
  type: "Dump"
  bottom: "fc8"
  top: "fc8"
  dump_param {
    filename: "fc8_dump_out.dat"
    method:   DumpMethod_PROTO_TXT
  }
}

layer {
  name: "accuracy_1"
  type: "Accuracy"
  bottom: "fc8"
  bottom: "label"
  top: "accuracy_1"
  include {
    phase: TEST
  }
  accuracy_param {
    top_k: 1
  }
}
layer {
  name: "accuracy_5"
  type: "Accuracy"
  bottom: "fc8"
  bottom: "label"
  top: "accuracy_5"
  include {
    phase: TEST
  }
  accuracy_param {
    top_k: 5
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc8"
  bottom: "label"
  top: "loss"
}
