name: "AlexNet"
state {
  phase: TEST
}
debug_info: true
roi_accuracy: NONE
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 227
    mean_file: "/home/scratch.yilinz_t19x/t19x/caffe-master-amodel/data/ilsvrc12/imagenet_mean.binaryproto"
  }
  data_param {
    source: "/home/scratch.yilinz_t19x/t19x/caffe-master-amodel/../val_db"
    batch_size: 50
    backend: LMDB
  }
}
layer {
  name: "data_convert0"
  type: "Convertor"
  bottom: "data"
  top: "data"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 269731
      shifter: 20
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 372
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: false
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 587714
        shifter: 11
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 604723
        shifter: 14
        comp_scale: 2
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    input_mean: 371.67580800696931
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "relu1"
}
layer {
  name: "relu1_convert0"
  type: "Convertor"
  bottom: "relu1"
  top: "relu1"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 292847
      shifter: 20
      comp_scale: 50861
      comp_shifter: 20
      bits: 16
      offset: 117328
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "relu1_convert1"
  type: "Convertor"
  bottom: "relu1"
  top: "relu1"
  convert_param {
    from: DBL
    to: DBL
    to_coef {
      scale: 1
      shifter: 0
      comp_scale: 1
      comp_shifter: 0
      bits: 16
      offset: -1589
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0
  }
}
layer {
  name: "norm1"
  type: "NVLRN"
  bottom: "relu1"
  top: "norm1"
  nv_lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
    norm_region: ACROSS_CHANNELS
    k: 1
    lut_param {
      density_start: 3
      density_win_size: 5
      raw_tbl_entry: 257
      density_tbl_entry: 65
      sym: NO_SYM
      lut_convert {
        from: DBL
        to: INT
        to_coef {
          scale: 1048543
          shifter: 5
          comp_scale: 32
          comp_shifter: 20
          bits: 16
          offset: 0
        }
        allow_saturate: false
        method: STD_RN
        dr_ratio: 0.3
      }
      raw_min: -1.8596236132251811e-09
      raw_max: 228829.75461556812
      total_index_bits: 16
      is_density_enabled: false
    }
  }
}
layer {
  name: "norm1_convert0"
  type: "Convertor"
  bottom: "norm1"
  top: "norm1"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 971303
      shifter: 19
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 69
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "norm1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: false
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 538304
        shifter: 11
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.8
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 997252
        shifter: 14
        comp_scale: 8
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    input_mean: 68.822786066364756
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "relu2_convert0"
  type: "Convertor"
  bottom: "conv2"
  top: "conv2"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 151580
      shifter: 20
      comp_scale: 14896
      comp_shifter: 20
      bits: 16
      offset: 226673
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "relu2_convert1"
  type: "Convertor"
  bottom: "conv2"
  top: "conv2"
  convert_param {
    from: DBL
    to: DBL
    to_coef {
      scale: 1
      shifter: 0
      comp_scale: 1
      comp_shifter: 0
      bits: 16
      offset: -465
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0
  }
}
layer {
  name: "norm2"
  type: "NVLRN"
  bottom: "conv2"
  top: "norm2"
  nv_lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
    norm_region: ACROSS_CHANNELS
    k: 1
    lut_param {
      density_start: 40
      density_win_size: 2
      raw_tbl_entry: 257
      density_tbl_entry: 65
      sym: NO_SYM
      lut_convert {
        from: DBL
        to: INT
        to_coef {
          scale: 1048543
          shifter: 5
          comp_scale: 32
          comp_shifter: 20
          bits: 16
          offset: 0
        }
        allow_saturate: false
        method: STD_RN
        dr_ratio: 0.3
      }
      raw_min: -2.7755576316793745e-10
      raw_max: 35652.594782357781
      total_index_bits: 16
      is_density_enabled: false
    }
  }
}
layer {
  name: "norm2_convert0"
  type: "Convertor"
  bottom: "norm2"
  top: "norm2"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 971304
      shifter: 19
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 69
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "norm2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: false
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 556505
        shifter: 11
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 1030959
        shifter: 14
        comp_scale: 8
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    input_mean: 68.823667284919409
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "relu3_convert0"
  type: "Convertor"
  bottom: "conv3"
  top: "conv3"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 1005
      shifter: 20
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 133004
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: false
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 582688
        shifter: 11
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.8
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 562268
        shifter: 15
        comp_scale: 8
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    input_mean: 264.21264721527393
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "relu4_convert0"
  type: "Convertor"
  bottom: "conv4"
  top: "conv4"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 4394
      shifter: 20
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 30421
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: false
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 768922
        shifter: 11
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.8
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 884618
        shifter: 16
        comp_scale: 16
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    input_mean: 221.61255839376201
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
layer {
  name: "relu5_convert0"
  type: "Convertor"
  bottom: "conv5"
  top: "conv5"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 3234
      shifter: 20
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 41332
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "conv5"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 764685
        shifter: 8
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 1018706
        shifter: 16
        comp_scale: 128
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: false
      method: SIMPLE_RN
      dr_ratio: 0
    }
    input_mean: 191.3763267841428
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "relu6_convert0"
  type: "Convertor"
  bottom: "fc6"
  top: "fc6"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 1213
      shifter: 20
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 110177
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 898208
        shifter: 9
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 1033681
        shifter: 14
        comp_scale: 64
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: false
      method: SIMPLE_RN
      dr_ratio: 0
    }
    input_mean: 55.374671983926838
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "relu7_convert0"
  type: "Convertor"
  bottom: "fc7"
  top: "fc7"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 1861
      shifter: 20
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 71836
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc8"
  type: "InnerProduct"
  bottom: "fc7"
  top: "fc8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1000
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 870493
        shifter: 9
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 779773
        shifter: 12
        comp_scale: 64
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: false
      method: SIMPLE_RN
      dr_ratio: 0
    }
    input_mean: 17.790751898323848
  }
}
layer {
  name: "fc8_convert0"
  type: "Convertor"
  bottom: "fc8"
  top: "fc8"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 80805
      shifter: 20
      comp_scale: 1116
      comp_shifter: 20
      bits: 16
      offset: 233125
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "fc8_convert1"
  type: "Convertor"
  bottom: "fc8"
  top: "fc8"
  convert_param {
    from: DBL
    to: DBL
    to_coef {
      scale: 1
      shifter: 0
      comp_scale: 1
      comp_shifter: 0
      bits: 16
      offset: -19
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0
  }
}
layer {
  name: "accuracy_1"
  type: "Accuracy"
  bottom: "fc8"
  bottom: "label"
  top: "accuracy_1"
  include {
    phase: TEST
  }
  accuracy_param {
    top_k: 1
  }
}
layer {
  name: "accuracy_5"
  type: "Accuracy"
  bottom: "fc8"
  bottom: "label"
  top: "accuracy_5"
  include {
    phase: TEST
  }
  accuracy_param {
    top_k: 5
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc8"
  bottom: "label"
  top: "loss"
}
