name: "GoogleNet"
state {
  phase: TEST
}
debug_info: true
roi_accuracy: NONE
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 227
    mean_file: "/home/scratch.yilinz_t19x_2/t19x/caffe-master-amodel/data/ilsvrc12/imagenet_mean.binaryproto"
    shifter: 0
    bits: 8
  }
  data_param {
    source: "/home/scratch.yilinz_t19x_2/t19x/caffe-master-amodel/../val_db"
    batch_size: 50
    backend: LMDB
  }
}
layer {
  name: "data_convert0"
  type: "Convertor"
  bottom: "data"
  top: "data"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 33720
      shifter: 17
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "conv1_7x7_s2"
  type: "Convolution"
  bottom: "data"
  top: "conv1_7x7_s2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 2
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 105.503466050982
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
      is_enable_dr_check: false
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 6.78553938911266
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
      is_enable_dr_check: false
    }
    input_mean: 0
  }
}
layer {
  name: "conv1_relu_7x7"
  type: "ReLU"
  bottom: "conv1_7x7_s2"
  top: "conv1_7x7_s2"
}
layer {
  name: "conv1_relu_7x7_convert0"
  type: "Convertor"
  bottom: "conv1_7x7_s2"
  top: "conv1_7x7_s2"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 39189
      shifter: 14
      comp_scale: 1
      comp_shifter: 0
      bits: 16
      offset: 13700.0040266185
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "pool1_3x3_s2"
  type: "Pooling"
  bottom: "conv1_7x7_s2"
  top: "pool1_3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "pool1_norm1_convert_in0"
  type: "Convertor"
  bottom: "pool1_3x3_s2"
  top: "pool1_3x3_s2"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 64605
      shifter: 16
      comp_scale: 1
      comp_shifter: 0
      bits: 17
      offset: -32767
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.1
    is_enable_dr_check: false
  }
}

layer {
  name: "pool1_norm1"
  type: "NVLRN"
  bottom: "pool1_3x3_s2"
  top: "pool1_norm1"
  nv_lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
    norm_region: ACROSS_CHANNELS
    k: 1
    lut_param {
      density_start: -9.67004278877094e-09
      density_win_size: 22
      raw_tbl_entry: 65
      density_tbl_entry: 257
      sym: NO_SYM
      lut_convert {
        from: DBL
        to: INT
        to_coef {
          scale: 32767.0000000001
          shifter: 0
          comp_scale: 1
          comp_shifter: 0
          bits: 16
          offset: 0
        }
        allow_saturate: false
        method: STD_RN
        dr_ratio: 0
      }
      raw_step_method: EXP_STEP
      raw_min: 2.3283064365387e-10
      raw_max: 8589934592
      priority: LO_TBL
      shifter: 8
      interp_bits: 16
    }
  }
}
layer {
  name: "pool1_norm1_convert0"
  type: "Convertor"
  bottom: "pool1_norm1"
  top: "pool1_norm1"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 60708
      shifter: 34
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 36081309
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "conv2_3x3_reduce"
  type: "Convolution"
  bottom: "pool1_norm1"
  top: "conv2_3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 3
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 115.001241493674
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
      is_enable_dr_check: false
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 26.6311618582486
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
      is_enable_dr_check: false
    }
    input_mean: 68.8225540493931
  }
}
layer {
  name: "conv2_relu_3x3_reduce"
  type: "ReLU"
  bottom: "conv2_3x3_reduce"
  top: "conv2_3x3_reduce"
}
layer {
  name: "conv2_relu_3x3_reduce_convert0"
  type: "Convertor"
  bottom: "conv2_3x3_reduce"
  top: "conv2_3x3_reduce"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 49889
      shifter: 21
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 5360
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "conv2_3x3"
  type: "Convolution"
  bottom: "conv2_3x3_reduce"
  top: "conv2_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: WINOGRAD
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 3
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 4.10668668304278
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
      is_enable_dr_check: false
    }
    pra_feature_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 2
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    pra_weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 207.432377086137
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
      is_enable_dr_check: false
    }
    input_mean: 201.267974282535
  }
}
layer {
  name: "conv2_relu_3x3"
  type: "ReLU"
  bottom: "conv2_3x3"
  top: "conv2_3x3"
}
layer {
  name: "conv2_relu_3x3_convert0"
  type: "Convertor"
  bottom: "conv2_3x3"
  top: "conv2_3x3"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 63315
      shifter: 11
      comp_scale: 1
      comp_shifter: 0
      bits: 16
      offset: 1060
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "conv2_norm2_convert_in0"
  type: "Convertor"
  bottom: "conv2_3x3"
  top: "conv2_3x3"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 33036
      shifter: 15
      comp_scale: 1
      comp_shifter: 0
      bits: 17
      offset: -32755.7791859903
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.1
    is_enable_dr_check: false
  }
}
layer {
  name: "conv2_norm2"
  type: "NVLRN"
  bottom: "conv2_3x3"
  top: "conv2_norm2"
  nv_lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
    norm_region: ACROSS_CHANNELS
    k: 1
    lut_param {
      density_start: 5559.75097085405
      density_win_size: 15
      raw_tbl_entry: 65
      density_tbl_entry: 257
      sym: NO_SYM
      lut_convert {
        from: DBL
        to: INT
        to_coef {
          scale: 32767.0000000001
          shifter: 0
          comp_scale: 1
          comp_shifter: 0
          bits: 16
          offset: 0
        }
        allow_saturate: false
        method: STD_RN
        dr_ratio: 0
      }
      raw_step_method: EXP_STEP
      raw_min: 2.3283064365387e-10
      raw_max: 8589934592
      priority: LO_TBL
      shifter: 14
      interp_bits: 16
    }
  }
}
layer {
  name: "conv2_norm2_convert0"
  type: "Convertor"
  bottom: "conv2_norm2"
  top: "conv2_norm2"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 60708
      shifter: 37
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 288651575
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "pool2_3x3_s2"
  type: "Pooling"
  bottom: "conv2_norm2"
  top: "pool2_3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception_3a_1x1"
  type: "Convolution"
  bottom: "pool2_3x3_s2"
  top: "inception_3a_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 3
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 116.860034164468
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
      is_enable_dr_check: false
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 27.0617949823253
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
      is_enable_dr_check: false
    }
    input_mean: 68.8223407953627
  }
}
layer {
  name: "inception_3a_relu_1x1"
  type: "ReLU"
  bottom: "inception_3a_1x1"
  top: "inception_3a_1x1"
}
layer {
  name: "inception_3a_relu_1x1_convert0"
  type: "Convertor"
  bottom: "inception_3a_1x1"
  top: "inception_3a_1x1"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 40585
      shifter: 22
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 13177
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "inception_3a_3x3_reduce"
  type: "Convolution"
  bottom: "pool2_3x3_s2"
  top: "inception_3a_3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 3
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 79.188140672381
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
      is_enable_dr_check: false
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 18.3379479839232
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
      is_enable_dr_check: false
    }
    input_mean: 68.8223407953627
  }
}
layer {
  name: "inception_3a_relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_3a_3x3_reduce"
  top: "inception_3a_3x3_reduce"
}
layer {
  name: "inception_3a_relu_3x3_reduce_convert0"
  type: "Convertor"
  bottom: "inception_3a_3x3_reduce"
  top: "inception_3a_3x3_reduce"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 56444
      shifter: 21
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 4737
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "inception_3a_3x3"
  type: "Convolution"
  bottom: "inception_3a_3x3_reduce"
  top: "inception_3a_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: WINOGRAD
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 1
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 18.277861360602
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
      is_enable_dr_check: false
    }
    pra_feature_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 2
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    pra_weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 296.26395374225
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
      is_enable_dr_check: false
    }
    input_mean: 258.318022571391
  }
}
layer {
  name: "inception_3a_relu_3x3"
  type: "ReLU"
  bottom: "inception_3a_3x3"
  top: "inception_3a_3x3"
}
layer {
  name: "inception_3a_relu_3x3_convert0"
  type: "Convertor"
  bottom: "inception_3a_3x3"
  top: "inception_3a_3x3"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 60089
      shifter: 22
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 8901.31848261317
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "inception_3a_5x5_reduce"
  type: "Convolution"
  bottom: "pool2_3x3_s2"
  top: "inception_3a_5x5_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 4
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 166.105403449294
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
      is_enable_dr_check: false
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 19.2328814797145
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
      is_enable_dr_check: false
    }
    input_mean: 68.8223407953627
  }
}
layer {
  name: "inception_3a_relu_5x5_reduce"
  type: "ReLU"
  bottom: "inception_3a_5x5_reduce"
  top: "inception_3a_5x5_reduce"
}
layer {
  name: "inception_3a_relu_5x5_reduce_convert0"
  type: "Convertor"
  bottom: "inception_3a_5x5_reduce"
  top: "inception_3a_5x5_reduce"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 58091
      shifter: 21
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 4603
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "inception_3a_5x5"
  type: "Convolution"
  bottom: "inception_3a_5x5_reduce"
  top: "inception_3a_5x5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 2
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 234.82339057414
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
      is_enable_dr_check: false
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 31.2755288559766
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
      is_enable_dr_check: false
    }
    input_mean: 239.329712755466
  }
}
layer {
  name: "inception_3a_relu_5x5"
  type: "ReLU"
  bottom: "inception_3a_5x5"
  top: "inception_3a_5x5"
}
layer {
  name: "inception_3a_relu_5x5_convert0"
  type: "Convertor"
  bottom: "inception_3a_5x5"
  top: "inception_3a_5x5"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 35117
      shifter: 22
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 15228
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "inception_3a_pool"
  type: "Pooling"
  bottom: "pool2_3x3_s2"
  top: "inception_3a_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_3a_pool_proj"
  type: "Convolution"
  bottom: "inception_3a_pool"
  top: "inception_3a_pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 2
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 141.278502737507
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
      is_enable_dr_check: false
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 65.4326652457088
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
      is_enable_dr_check: false
    }
    input_mean: 68.8226671272218
  }
}
layer {
  name: "inception_3a_relu_pool_proj"
  type: "ReLU"
  bottom: "inception_3a_pool_proj"
  top: "inception_3a_pool_proj"
}
layer {
  name: "inception_3a_relu_pool_proj_convert0"
  type: "Convertor"
  bottom: "inception_3a_pool_proj"
  top: "inception_3a_pool_proj"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 33571
      shifter: 23
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 31865.7079746602
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "inception_3a_output"
  type: "Concat"
  bottom: "inception_3a_1x1"
  bottom: "inception_3a_3x3"
  bottom: "inception_3a_5x5"
  bottom: "inception_3a_pool_proj"
  top: "inception_3a_output"
}
layer {
  name: "inception_3b_1x1"
  type: "Convolution"
  bottom: "inception_3a_output"
  top: "inception_3b_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 3
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 182.756980438706
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
      is_enable_dr_check: false
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 5.981997568355
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
      is_enable_dr_check: false
    }
    input_mean: 486.922615761676
  }
}
layer {
  name: "inception_3b_relu_1x1"
  type: "ReLU"
  bottom: "inception_3b_1x1"
  top: "inception_3b_1x1"
}
layer {
  name: "inception_3b_relu_1x1_convert0"
  type: "Convertor"
  bottom: "inception_3b_1x1"
  top: "inception_3b_1x1"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 52659
      shifter: 20
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 2539
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "inception_3b_3x3_reduce"
  type: "Convolution"
  bottom: "inception_3a_output"
  top: "inception_3b_3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 2
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 188.983437856194
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
      is_enable_dr_check: false
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 12.3716036782986
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
      is_enable_dr_check: false
    }
    input_mean: 486.922615761676
  }
}
layer {
  name: "inception_3b_relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_3b_3x3_reduce"
  top: "inception_3b_3x3_reduce"
}
layer {
  name: "inception_3b_relu_3x3_reduce_convert0"
  type: "Convertor"
  bottom: "inception_3b_3x3_reduce"
  top: "inception_3b_3x3_reduce"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 53677
      shifter: 21
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 4981
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "inception_3b_3x3"
  type: "Convolution"
  bottom: "inception_3b_3x3_reduce"
  top: "inception_3b_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: WINOGRAD
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 2
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 4.16871283025582
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
      is_enable_dr_check: false
    }
    pra_feature_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 2
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    pra_weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 210.638443223784
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
      is_enable_dr_check: false
    }
    input_mean: 402.615548438342
  }
}
layer {
  name: "inception_3b_relu_3x3"
  type: "ReLU"
  bottom: "inception_3b_3x3"
  top: "inception_3b_3x3"
}
layer {
  name: "inception_3b_relu_3x3_convert0"
  type: "Convertor"
  bottom: "inception_3b_3x3"
  top: "inception_3b_3x3"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 37782
      shifter: 19
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 1769
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "inception_3b_5x5_reduce"
  type: "Convolution"
  bottom: "inception_3a_output"
  top: "inception_3b_5x5_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 2
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 191.872441547161
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
      is_enable_dr_check: false
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 12.5607292921367
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
      is_enable_dr_check: false
    }
    input_mean: 486.922615761676
  }
}
layer {
  name: "inception_3b_relu_5x5_reduce"
  type: "ReLU"
  bottom: "inception_3b_5x5_reduce"
  top: "inception_3b_5x5_reduce"
}
layer {
  name: "inception_3b_relu_5x5_reduce_convert0"
  type: "Convertor"
  bottom: "inception_3b_5x5_reduce"
  top: "inception_3b_5x5_reduce"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 60095
      shifter: 21
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 4449
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "inception_3b_5x5"
  type: "Convolution"
  bottom: "inception_3b_5x5_reduce"
  top: "inception_3b_5x5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 4
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 346.601170245127
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
      is_enable_dr_check: false
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 7.79710402599061
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
      is_enable_dr_check: false
    }
    input_mean: 354.199178767844
  }
}
layer {
  name: "inception_3b_relu_5x5"
  type: "ReLU"
  bottom: "inception_3b_5x5"
  top: "inception_3b_5x5"
}
layer {
  name: "inception_3b_relu_5x5_convert0"
  type: "Convertor"
  bottom: "inception_3b_5x5"
  top: "inception_3b_5x5"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 40400
      shifter: 20
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 3309
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "inception_3b_pool"
  type: "Pooling"
  bottom: "inception_3a_output"
  top: "inception_3b_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_3b_pool_proj"
  type: "Convolution"
  bottom: "inception_3b_pool"
  top: "inception_3b_pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 3
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 228.958410760271
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
      is_enable_dr_check: false
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 7.49426179582629
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
      is_enable_dr_check: false
    }
    input_mean: 486.922615761676
  }
}
layer {
  name: "inception_3b_relu_pool_proj"
  type: "ReLU"
  bottom: "inception_3b_pool_proj"
  top: "inception_3b_pool_proj"
}
layer {
  name: "inception_3b_relu_pool_proj_convert0"
  type: "Convertor"
  bottom: "inception_3b_pool_proj"
  top: "inception_3b_pool_proj"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 42033
      shifter: 20
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 3181
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "inception_3b_output"
  type: "Concat"
  bottom: "inception_3b_1x1"
  bottom: "inception_3b_3x3"
  bottom: "inception_3b_5x5"
  bottom: "inception_3b_pool_proj"
  top: "inception_3b_output"
}
layer {
  name: "pool3_3x3_s2"
  type: "Pooling"
  bottom: "inception_3b_output"
  top: "pool3_3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception_4a_1x1"
  type: "Convolution"
  bottom: "pool3_3x3_s2"
  top: "inception_4a_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 4
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 230.266832057992
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
      is_enable_dr_check: false
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 4.32344889586428
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
      is_enable_dr_check: false
    }
    input_mean: 424.440159158775
  }
}
layer {
  name: "inception_4a_relu_1x1"
  type: "ReLU"
  bottom: "inception_4a_1x1"
  top: "inception_4a_1x1"
}
layer {
  name: "inception_4a_relu_1x1_convert0"
  type: "Convertor"
  bottom: "inception_4a_1x1"
  top: "inception_4a_1x1"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 48647
      shifter: 20
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 2759
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "inception_4a_3x3_reduce"
  type: "Convolution"
  bottom: "pool3_3x3_s2"
  top: "inception_4a_3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 3
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 213.669944660785
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
      is_enable_dr_check: false
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 8.02365740707632
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
      is_enable_dr_check: false
    }
    input_mean: 424.440159158775
  }
}
layer {
  name: "inception_4a_relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_4a_3x3_reduce"
  top: "inception_4a_3x3_reduce"
}
layer {
  name: "inception_4a_relu_3x3_reduce_convert0"
  type: "Convertor"
  bottom: "inception_4a_3x3_reduce"
  top: "inception_4a_3x3_reduce"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 46109
      shifter: 21
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 5799
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "inception_4a_3x3"
  type: "Convolution"
  bottom: "inception_4a_3x3_reduce"
  top: "inception_4a_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 208
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: WINOGRAD
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 2
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 2.05426965130552
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
      is_enable_dr_check: false
    }
    pra_feature_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 2
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    pra_weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 186.315617983919
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
      is_enable_dr_check: false
    }
    input_mean: 722.737737392137
  }
}
layer {
  name: "inception_4a_relu_3x3"
  type: "ReLU"
  bottom: "inception_4a_3x3"
  top: "inception_4a_3x3"
}
layer {
  name: "inception_4a_relu_3x3_convert0"
  type: "Convertor"
  bottom: "inception_4a_3x3"
  top: "inception_4a_3x3"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 51192
      shifter: 19
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 1311
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "inception_4a_5x5_reduce"
  type: "Convolution"
  bottom: "pool3_3x3_s2"
  top: "inception_4a_5x5_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 3
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 249.757731160591
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
      is_enable_dr_check: false
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 9.37881306976838
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
      is_enable_dr_check: false
    }
    input_mean: 424.440159158775
  }
}
layer {
  name: "inception_4a_relu_5x5_reduce"
  type: "ReLU"
  bottom: "inception_4a_5x5_reduce"
  top: "inception_4a_5x5_reduce"
}
layer {
  name: "inception_4a_relu_5x5_reduce_convert0"
  type: "Convertor"
  bottom: "inception_4a_5x5_reduce"
  top: "inception_4a_5x5_reduce"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 38249
      shifter: 20
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 3495
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "inception_4a_5x5"
  type: "Convolution"
  bottom: "inception_4a_5x5_reduce"
  top: "inception_4a_5x5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 2
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 172.204945815858
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
      is_enable_dr_check: false
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 14.7283359260548
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
      is_enable_dr_check: false
    }
    input_mean: 372.648433655829
  }
}
layer {
  name: "inception_4a_relu_5x5"
  type: "ReLU"
  bottom: "inception_4a_5x5"
  top: "inception_4a_5x5"
}
layer {
  name: "inception_4a_relu_5x5_convert0"
  type: "Convertor"
  bottom: "inception_4a_5x5"
  top: "inception_4a_5x5"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 57120
      shifter: 22
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 9399
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "inception_4a_pool"
  type: "Pooling"
  bottom: "pool3_3x3_s2"
  top: "inception_4a_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4a_pool_proj"
  type: "Convolution"
  bottom: "inception_4a_pool"
  top: "inception_4a_pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 3
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 188.650596898886
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
      is_enable_dr_check: false
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 7.08413980057031
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
      is_enable_dr_check: false
    }
    input_mean: 424.440159158775
  }
}
layer {
  name: "inception_4a_relu_pool_proj"
  type: "ReLU"
  bottom: "inception_4a_pool_proj"
  top: "inception_4a_pool_proj"
}
layer {
  name: "inception_4a_relu_pool_proj_convert0"
  type: "Convertor"
  bottom: "inception_4a_pool_proj"
  top: "inception_4a_pool_proj"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 59378
      shifter: 21
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 4521
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "inception_4a_output"
  type: "Concat"
  bottom: "inception_4a_1x1"
  bottom: "inception_4a_3x3"
  bottom: "inception_4a_5x5"
  bottom: "inception_4a_pool_proj"
  top: "inception_4a_output"
}
layer {
  name: "loss1_ave_pool"
  type: "Pooling"
  bottom: "inception_4a_output"
  top: "loss1_ave_pool"
  pooling_param {
    pool: AVE
    kernel_size: 5
    stride: 3
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: SIMPLE_RN
      dr_ratio: 0.2
    }
  }
}
layer {
  name: "loss1_conv"
  type: "Convolution"
  bottom: "loss1_ave_pool"
  top: "loss1_conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 3
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
      is_enable_dr_check: false
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 303.011200373391
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
      is_enable_dr_check: false
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 7.59712750111314
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
      is_enable_dr_check: false
    }
    input_mean: 638.1891894147
  }
}
layer {
  name: "loss1_relu_conv"
  type: "ReLU"
  bottom: "loss1_conv"
  top: "loss1_conv"
}
layer {
  name: "loss1_relu_conv_convert0"
  type: "Convertor"
  bottom: "loss1_conv"
  top: "loss1_conv"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 47928
      shifter: 18
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 698.935730102409
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
    is_enable_dr_check: false
  }
}
layer {
  name: "loss1_fc"
  type: "InnerProduct"
  bottom: "loss1_conv"
  top: "loss1_fc"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 1616.31851854732
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
      is_enable_dr_check: false
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 35.0790023834375
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
