name: "GoogleNet"
state {
  phase: TEST
}
debug_info: true
roi_accuracy: NONE
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 227
    mean_file: "/home/scratch.yilinz_t19x_2/t19x/caffe-master-amodel/data/ilsvrc12/imagenet_mean.binaryproto"
    shifter: 0
    bits: 8
    type: INT
  }
  data_param {
    source: "/home/scratch.yilinz_t19x_2/t19x/caffe-master-amodel/../val_db"
    batch_size: 50
    backend: LMDB
  }
}
layer {
  name: "data_convert0"
  type: "Convertor"
  bottom: "data"
  top: "data"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 16860
      shifter: 16
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "conv1_7x7_s2"
  type: "Convolution"
  bottom: "data"
  top: "conv1_7x7_s2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 105.50346605098159
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 27.142157556450645
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    input_mean: 0
  }
}
layer {
  name: "conv1_relu_7x7"
  type: "ReLU"
  bottom: "conv1_7x7_s2"
  top: "conv1_7x7_s2"
}
layer {
  name: "conv1_relu_7x7_convert0"
  type: "Convertor"
  bottom: "conv1_7x7_s2"
  top: "conv1_7x7_s2"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 19595
      shifter: 16
      comp_scale: 1
      comp_shifter: 0
      bits: 16
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "pool1_3x3_s2"
  type: "Pooling"
  bottom: "conv1_7x7_s2"
  top: "pool1_3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "pool1_norm1_convert_in0"
  type: "Convertor"
  bottom: "pool1_3x3_s2"
  top: "pool1_3x3_s2"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 32302
      shifter: 14
      comp_scale: 1
      comp_shifter: 0
      bits: 17
      offset: -0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.1
  }
}
layer {
  name: "pool1_norm1"
  type: "NVLRN"
  bottom: "pool1_3x3_s2"
  top: "pool1_norm1"
  nv_lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
    norm_region: ACROSS_CHANNELS
    k: 1
    lut_param {
      density_start: 17964.168047239418
      density_win_size: 20
      raw_tbl_entry: 65
      density_tbl_entry: 257
      sym: NO_SYM
      lut_convert {
        from: DBL
        to: INT
        to_coef {
          scale: 32767
          shifter: 0
          comp_scale: 1
          comp_shifter: 0
          bits: 16
          offset: 0
        }
        allow_saturate: false
        method: STD_RN
        dr_ratio: 0
      }
      raw_step_method: EXP_STEP
      raw_min: -9.67004278877094e-09
      raw_max: 4294967296
      priority: LO_TBL
      shifter: 8
      interp_bits: 16
      disable_density: false
      exp_raw_shifter: -32
      overflow_priority: LE_TBL
      underflow_priority: LE_TBL
      density_overflow_slope: -2147483648
      density_overflow_shifter: 73
      density_underflow_slope: -2147483648
      density_underflow_shifter: 68
      raw_overflow_slope: 0
      raw_overflow_shifter: 1
      raw_underflow_slope: 32767
      raw_underflow_shifter: 2
    }
  }
}
layer {
  name: "pool1_norm1_convert0"
  type: "Convertor"
  bottom: "pool1_norm1"
  top: "pool1_norm1"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 30411
      shifter: 26
      comp_scale: 1
      comp_shifter: 0
      bits: 16
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "conv2_3x3_reduce"
  type: "Convolution"
  bottom: "pool1_norm1"
  top: "conv2_3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 115.00124149367417
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 13660.896661385337
        shifter: 0
        comp_scale: 2
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    input_mean: 0
  }
}
layer {
  name: "conv2_relu_3x3_reduce"
  type: "ReLU"
  bottom: "conv2_3x3_reduce"
  top: "conv2_3x3_reduce"
}
layer {
  name: "conv2_relu_3x3_reduce_convert0"
  type: "Convertor"
  bottom: "conv2_3x3_reduce"
  top: "conv2_3x3_reduce"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 24896
      shifter: 30
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "conv2_3x3"
  type: "Convolution"
  bottom: "conv2_3x3_reduce"
  top: "conv2_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: WINOGRAD
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 32.851519349101224
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    pra_feature_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 2
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    pra_weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 207.43237708613688
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    input_mean: 0
  }
}
layer {
  name: "conv2_relu_3x3"
  type: "ReLU"
  bottom: "conv2_3x3"
  top: "conv2_3x3"
}
layer {
  name: "conv2_relu_3x3_convert0"
  type: "Convertor"
  bottom: "conv2_3x3"
  top: "conv2_3x3"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 22515
      shifter: 14
      comp_scale: 1
      comp_shifter: 0
      bits: 16
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "conv2_norm2_convert_in0"
  type: "Convertor"
  bottom: "conv2_3x3"
  top: "conv2_3x3"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 23227
      shifter: 13
      comp_scale: 1
      comp_shifter: 0
      bits: 17
      offset: -0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.1
  }
}
layer {
  name: "conv2_norm2"
  type: "NVLRN"
  bottom: "conv2_3x3"
  top: "conv2_norm2"
  nv_lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
    norm_region: ACROSS_CHANNELS
    k: 1
    lut_param {
      density_start: 397.12506934671671
      density_win_size: 15
      raw_tbl_entry: 65
      density_tbl_entry: 257
      sym: NO_SYM
      lut_convert {
        from: DBL
        to: INT
        to_coef {
          scale: 32767
          shifter: 0
          comp_scale: 1
          comp_shifter: 0
          bits: 16
          offset: 0
        }
        allow_saturate: false
        method: STD_RN
        dr_ratio: 0
      }
      raw_step_method: EXP_STEP
      raw_min: -2.7755576316793745e-10
      raw_max: 4294967296
      priority: LO_TBL
      shifter: 14
      interp_bits: 16
      disable_density: false
      exp_raw_shifter: -32
      overflow_priority: LE_TBL
      underflow_priority: LE_TBL
      density_overflow_slope: -2147483648
      density_overflow_shifter: 69
      density_underflow_slope: -2147483648
      density_underflow_shifter: 69
      raw_overflow_slope: 0
      raw_overflow_shifter: 1
      raw_underflow_slope: 32767
      raw_underflow_shifter: 2
    }
  }
}
layer {
  name: "conv2_norm2_convert0"
  type: "Convertor"
  bottom: "conv2_norm2"
  top: "conv2_norm2"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 30946
      shifter: 29
      comp_scale: 1
      comp_shifter: 0
      bits: 16
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "pool2_3x3_s2"
  type: "Pooling"
  bottom: "conv2_norm2"
  top: "pool2_3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception_3a_1x1"
  type: "Convolution"
  bottom: "pool2_3x3_s2"
  top: "inception_3a_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 116.86003416446836
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 14125.960571364356
        shifter: 0
        comp_scale: 2
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    input_mean: 0
  }
}
layer {
  name: "inception_3a_relu_1x1"
  type: "ReLU"
  bottom: "inception_3a_1x1"
  top: "inception_3a_1x1"
}
layer {
  name: "inception_3a_relu_1x1_convert0"
  type: "Convertor"
  bottom: "inception_3a_1x1"
  top: "inception_3a_1x1"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 19903
      shifter: 31
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "inception_3a_3x3_reduce"
  type: "Convolution"
  bottom: "pool2_3x3_s2"
  top: "inception_3a_3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 79.188140672381
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 19144.415982000872
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    input_mean: 0
  }
}
layer {
  name: "inception_3a_relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_3a_3x3_reduce"
  top: "inception_3a_3x3_reduce"
}
layer {
  name: "inception_3a_relu_3x3_reduce_convert0"
  type: "Convertor"
  bottom: "inception_3a_3x3_reduce"
  top: "inception_3a_3x3_reduce"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 27682
      shifter: 30
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "inception_3a_3x3"
  type: "Convolution"
  bottom: "inception_3a_3x3_reduce"
  top: "inception_3a_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: WINOGRAD
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 36.555989148942452
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    pra_feature_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 2
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    pra_weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 296.26395374225035
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    input_mean: 0
  }
}
layer {
  name: "inception_3a_relu_3x3"
  type: "ReLU"
  bottom: "inception_3a_3x3"
  top: "inception_3a_3x3"
}
layer {
  name: "inception_3a_relu_3x3_convert0"
  type: "Convertor"
  bottom: "inception_3a_3x3"
  top: "inception_3a_3x3"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 30043
      shifter: 22
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "inception_3a_5x5_reduce"
  type: "Convolution"
  bottom: "pool2_3x3_s2"
  top: "inception_3a_5x5_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 166.10540344929416
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 20078.706947090108
        shifter: 0
        comp_scale: 2
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    input_mean: 0
  }
}
layer {
  name: "inception_3a_relu_5x5_reduce"
  type: "ReLU"
  bottom: "inception_3a_5x5_reduce"
  top: "inception_3a_5x5_reduce"
}
layer {
  name: "inception_3a_relu_5x5_reduce_convert0"
  type: "Convertor"
  bottom: "inception_3a_5x5_reduce"
  top: "inception_3a_5x5_reduce"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 28493
      shifter: 31
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "inception_3a_5x5"
  type: "Convolution"
  bottom: "inception_3a_5x5_reduce"
  top: "inception_3a_5x5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 234.82339057414018
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 125.11673531868614
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    input_mean: 0
  }
}
layer {
  name: "inception_3a_relu_5x5"
  type: "ReLU"
  bottom: "inception_3a_5x5"
  top: "inception_3a_5x5"
}
layer {
  name: "inception_3a_relu_5x5_convert0"
  type: "Convertor"
  bottom: "inception_3a_5x5"
  top: "inception_3a_5x5"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 17555
      shifter: 23
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "inception_3a_pool"
  type: "Pooling"
  bottom: "pool2_3x3_s2"
  top: "inception_3a_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_3a_pool_proj"
  type: "Convolution"
  bottom: "inception_3a_pool"
  top: "inception_3a_pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 141.27850273750724
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 34155.296522379678
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    input_mean: 0
  }
}
layer {
  name: "inception_3a_relu_pool_proj"
  type: "ReLU"
  bottom: "inception_3a_pool_proj"
  top: "inception_3a_pool_proj"
}
layer {
  name: "inception_3a_relu_pool_proj_convert0"
  type: "Convertor"
  bottom: "inception_3a_pool_proj"
  top: "inception_3a_pool_proj"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 16463
      shifter: 31
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "inception_3a_output"
  type: "Concat"
  bottom: "inception_3a_1x1"
  bottom: "inception_3a_3x3"
  bottom: "inception_3a_5x5"
  bottom: "inception_3a_pool_proj"
  top: "inception_3a_output"
}
layer {
  name: "inception_3b_1x1"
  type: "Convolution"
  bottom: "inception_3a_output"
  top: "inception_3b_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 182.75698043870634
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 47.853161636826613
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    input_mean: 0
  }
}
layer {
  name: "inception_3b_relu_1x1"
  type: "ReLU"
  bottom: "inception_3b_1x1"
  top: "inception_3b_1x1"
}
layer {
  name: "inception_3b_relu_1x1_convert0"
  type: "Convertor"
  bottom: "inception_3b_1x1"
  top: "inception_3b_1x1"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 26329
      shifter: 22
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "inception_3b_3x3_reduce"
  type: "Convolution"
  bottom: "inception_3a_output"
  top: "inception_3b_3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 188.9834378561944
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 49.483499764041426
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    input_mean: 0
  }
}
layer {
  name: "inception_3b_relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_3b_3x3_reduce"
  top: "inception_3b_3x3_reduce"
}
layer {
  name: "inception_3b_relu_3x3_reduce_convert0"
  type: "Convertor"
  bottom: "inception_3b_3x3_reduce"
  top: "inception_3b_3x3_reduce"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 26843
      shifter: 22
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "inception_3b_3x3"
  type: "Convolution"
  bottom: "inception_3b_3x3_reduce"
  top: "inception_3b_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: WINOGRAD
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 16.676664805731463
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    pra_feature_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 2
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    pra_weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 210.63844322378361
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    input_mean: 0
  }
}
layer {
  name: "inception_3b_relu_3x3"
  type: "ReLU"
  bottom: "inception_3b_3x3"
  top: "inception_3b_3x3"
}
layer {
  name: "inception_3b_relu_3x3_convert0"
  type: "Convertor"
  bottom: "inception_3b_3x3"
  top: "inception_3b_3x3"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 18888
      shifter: 20
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "inception_3b_5x5_reduce"
  type: "Convolution"
  bottom: "inception_3a_output"
  top: "inception_3b_5x5_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 191.87244154716061
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 50.239957658351848
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    input_mean: 0
  }
}
layer {
  name: "inception_3b_relu_5x5_reduce"
  type: "ReLU"
  bottom: "inception_3b_5x5_reduce"
  top: "inception_3b_5x5_reduce"
}
layer {
  name: "inception_3b_relu_5x5_reduce_convert0"
  type: "Convertor"
  bottom: "inception_3b_5x5_reduce"
  top: "inception_3b_5x5_reduce"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 30048
      shifter: 22
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "inception_3b_5x5"
  type: "Convolution"
  bottom: "inception_3b_5x5_reduce"
  top: "inception_3b_5x5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 346.60117024512681
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 124.74839174107284
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    input_mean: 0
  }
}
layer {
  name: "inception_3b_relu_5x5"
  type: "ReLU"
  bottom: "inception_3b_5x5"
  top: "inception_3b_5x5"
}
layer {
  name: "inception_3b_relu_5x5_convert0"
  type: "Convertor"
  bottom: "inception_3b_5x5"
  top: "inception_3b_5x5"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 20200
      shifter: 23
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "inception_3b_pool"
  type: "Pooling"
  bottom: "inception_3a_output"
  top: "inception_3b_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_3b_pool_proj"
  type: "Convolution"
  bottom: "inception_3b_pool"
  top: "inception_3b_pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 228.95841076027136
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 59.950562828962894
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    input_mean: 0
  }
}
layer {
  name: "inception_3b_relu_pool_proj"
  type: "ReLU"
  bottom: "inception_3b_pool_proj"
  top: "inception_3b_pool_proj"
}
layer {
  name: "inception_3b_relu_pool_proj_convert0"
  type: "Convertor"
  bottom: "inception_3b_pool_proj"
  top: "inception_3b_pool_proj"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 21016
      shifter: 22
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "inception_3b_output"
  type: "Concat"
  bottom: "inception_3b_1x1"
  bottom: "inception_3b_3x3"
  bottom: "inception_3b_5x5"
  bottom: "inception_3b_pool_proj"
  top: "inception_3b_output"
}
layer {
  name: "pool3_3x3_s2"
  type: "Pooling"
  bottom: "inception_3b_output"
  top: "pool3_3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception_4a_1x1"
  type: "Convolution"
  bottom: "pool3_3x3_s2"
  top: "inception_4a_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 230.26683205799156
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 69.16979407028137
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    input_mean: 0
  }
}
layer {
  name: "inception_4a_relu_1x1"
  type: "ReLU"
  bottom: "inception_4a_1x1"
  top: "inception_4a_1x1"
}
layer {
  name: "inception_4a_relu_1x1_convert0"
  type: "Convertor"
  bottom: "inception_4a_1x1"
  top: "inception_4a_1x1"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 19611
      shifter: 23
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "inception_4a_3x3_reduce"
  type: "Convolution"
  bottom: "pool3_3x3_s2"
  top: "inception_4a_3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 213.66994466078458
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 64.184259361646752
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    input_mean: 0
  }
}
layer {
  name: "inception_4a_relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_4a_3x3_reduce"
  top: "inception_4a_3x3_reduce"
}
layer {
  name: "inception_4a_relu_3x3_reduce_convert0"
  type: "Convertor"
  bottom: "inception_4a_3x3_reduce"
  top: "inception_4a_3x3_reduce"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 23055
      shifter: 23
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "inception_4a_3x3"
  type: "Convolution"
  bottom: "inception_4a_3x3_reduce"
  top: "inception_4a_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 208
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: WINOGRAD
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 8.216616748173621
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    pra_feature_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 2
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    pra_weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 186.31561798391931
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    input_mean: 0
  }
}
layer {
  name: "inception_4a_relu_3x3"
  type: "ReLU"
  bottom: "inception_4a_3x3"
  top: "inception_4a_3x3"
}
layer {
  name: "inception_4a_relu_3x3_convert0"
  type: "Convertor"
  bottom: "inception_4a_3x3"
  top: "inception_4a_3x3"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 20637
      shifter: 20
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "inception_4a_5x5_reduce"
  type: "Convolution"
  bottom: "pool3_3x3_s2"
  top: "inception_4a_5x5_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 249.75773116059102
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 75.0246602058953
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    input_mean: 0
  }
}
layer {
  name: "inception_4a_relu_5x5_reduce"
  type: "ReLU"
  bottom: "inception_4a_5x5_reduce"
  top: "inception_4a_5x5_reduce"
}
layer {
  name: "inception_4a_relu_5x5_reduce_convert0"
  type: "Convertor"
  bottom: "inception_4a_5x5_reduce"
  top: "inception_4a_5x5_reduce"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 19126
      shifter: 22
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "inception_4a_5x5"
  type: "Convolution"
  bottom: "inception_4a_5x5_reduce"
  top: "inception_4a_5x5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 172.20494581585757
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 58.913375181513779
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    input_mean: 0
  }
}
layer {
  name: "inception_4a_relu_5x5"
  type: "ReLU"
  bottom: "inception_4a_5x5"
  top: "inception_4a_5x5"
}
layer {
  name: "inception_4a_relu_5x5_convert0"
  type: "Convertor"
  bottom: "inception_4a_5x5"
  top: "inception_4a_5x5"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 23025
      shifter: 23
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "inception_4a_pool"
  type: "Pooling"
  bottom: "pool3_3x3_s2"
  top: "inception_4a_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4a_pool_proj"
  type: "Convolution"
  bottom: "inception_4a_pool"
  top: "inception_4a_pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 188.65059689888645
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 56.668703964474268
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    input_mean: 0
  }
}
layer {
  name: "inception_4a_relu_pool_proj"
  type: "ReLU"
  bottom: "inception_4a_pool_proj"
  top: "inception_4a_pool_proj"
}
layer {
  name: "inception_4a_relu_pool_proj_convert0"
  type: "Convertor"
  bottom: "inception_4a_pool_proj"
  top: "inception_4a_pool_proj"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 23937
      shifter: 23
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "inception_4a_output"
  type: "Concat"
  bottom: "inception_4a_1x1"
  bottom: "inception_4a_3x3"
  bottom: "inception_4a_5x5"
  bottom: "inception_4a_pool_proj"
  top: "inception_4a_output"
}
layer {
  name: "loss1_ave_pool"
  type: "Pooling"
  bottom: "inception_4a_output"
  top: "loss1_ave_pool"
  pooling_param {
    pool: AVE
    kernel_size: 5
    stride: 3
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: SIMPLE_RN
      dr_ratio: 0.2
    }
  }
}
layer {
  name: "loss1_conv"
  type: "Convolution"
  bottom: "loss1_ave_pool"
  top: "loss1_conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    engine: SPLITC
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 303.01120037339081
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 48.998750344471532
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    input_mean: 0
  }
}
layer {
  name: "loss1_relu_conv"
  type: "ReLU"
  bottom: "loss1_conv"
  top: "loss1_conv"
}
layer {
  name: "loss1_relu_conv_convert0"
  type: "Convertor"
  bottom: "loss1_conv"
  top: "loss1_conv"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 29724
      shifter: 20
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "loss1_fc"
  type: "InnerProduct"
  bottom: "loss1_conv"
  top: "loss1_fc"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 1616.3185185473167
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 2245.0152329013504
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
  }
}
layer {
  name: "loss1_relu_fc"
  type: "ReLU"
  bottom: "loss1_fc"
  top: "loss1_fc"
}
layer {
  name: "loss1_relu_fc_convert0"
  type: "Convertor"
  bottom: "loss1_fc"
  top: "loss1_fc"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 24906
      shifter: 23
      comp_scale: 1
      comp_shifter: 0
      bits: 8
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "loss1_drop_fc"
  type: "Dropout"
  bottom: "loss1_fc"
  top: "loss1_fc"
  dropout_param {
    dropout_ratio: 0.7
  }
}
layer {
  name: "loss1_classifier"
  type: "InnerProduct"
  bottom: "loss1_fc"
  top: "loss1_classifier"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1000
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    weight_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 1518.2704737562126
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 8
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.98
    }
    bias_convert {
      from: DBL
      to: INT
      to_coef {
        scale: 10120.046822917337
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 16
        offset: 0
      }
      allow_saturate: false
      method: STD_RN
      dr_ratio: 0.4
    }
    output_truncat {
      from: DBL
      to: INT
      to_coef {
        scale: 1
        shifter: 0
        comp_scale: 1
        comp_shifter: 0
        bits: 32
        offset: 0
      }
      allow_saturate: true
      method: SIMPLE_RN
      dr_ratio: 0
    }
  }
}
layer {
  name: "loss1_classifier_convert0"
  type: "Convertor"
  bottom: "loss1_classifier"
  top: "loss1_classifier"
  convert_param {
    from: DBL
    to: INT
    to_coef {
      scale: 17598
      shifter: 18
      comp_scale: 1
      comp_shifter: 0
      bits: 16
      offset: 0
    }
    allow_saturate: true
    method: SIMPLE_RN
    dr_ratio: 0.3
  }
}
layer {
  name: "loss1_top_1_convert_in0"
  type: "Convertor"
  bottom: "loss1_classifier"
  top: "loss1_classifier"
  convert_param {
    from: DBL
    to: DBL
